tutorials/viscoelastic/viscoelasticFluidFoam/PTT-Exponential/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          18;
        startFace       2437;
    }
    right
    {
        type            patch;
        nFaces          18;
        startFace       2455;
    }
    down
    {
        type            wall;
        nFaces          65;
        startFace       2473;
    }
    up
    {
        type            wall;
        nFaces          65;
        startFace       2538;
    }
    cylinder
    {
        type            wall;
        nFaces          40;
        startFace       2603;
    }
    defaultFaces
    {
        type            empty;
        nFaces          2540;
        startFace       2643;
    }
)

// ************************************************************************* //
